muryamuya/auto-spray-esp8266-atmega328p/auto_spray_main/src/auto_spray_main_wifi.cpp
#include "Arduino.h"
#include <Wire.h>
#include <LiquidCrystal_I2C.h>
#include <EEPROM.h>
#include <LittleFS.h>
#include <ESP8266Wifi.h>
#include <ESPAsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <DNSServer.h>

// Declare variables ---------------------------------------------------

/*
temperature.threshold = float, address at 0-3
deviceSet.backlight = byte, address 4
deviceSet.duration = byte, address at 5
timer1.hour = byte, address at 6
timer1.minute = byte, address at 7
timer1.setting = byte, address at 8
timer2.hour = byte, address at 9
timer2.minute = byte, address at 10
timer2.setting = byte, address at 11
timer3.hour = byte, address at 12
timer3.minute = byte, address at 13
timer3.setting = byte, address at 14
deviceSet.ssid = char array, address at 15 len, address at 16-47 data
deviceSet.pass = char array, address at 48 len, address at 49-112 data

RTC Address 0x68
LCD address 0x27
Arduino address 0x08
*/

#define EEPROM_SIZE 128
#define RTC_ADDRESS 0x68
#define LCD_ADDRESS 0x27
#define ATM_ADDRESS 0x08

IPAddress APIP(192, 168, 1, 1);
IPAddress subnet_mask(255, 255, 255, 0);

const byte WEB_PORT = 80;
const byte DNS_PORT = 53;

DNSServer dnsServer;
AsyncWebServer webServer(WEB_PORT);

class CaptiveRequestHandler : public AsyncWebHandler
{
public:
  CaptiveRequestHandler() {}
  virtual ~CaptiveRequestHandler() {}

  bool canHandle(AsyncWebServerRequest *request)
  {
    return true;
  }

  void handleRequest(AsyncWebServerRequest *request)
  {
    request->redirect("http://192.168.1.1");
  }
};

struct temperature_set
{
  float threshold, celcius;
} temperature;

struct timer_set
{
  byte hour, minute, setting;
} timer1, timer2, timer3;

struct RTC_now
{
  byte second, minute, hour, dayOfWeek, dayOfMonth, month, year;
} RTC;

struct device_settings
{
  byte backlight; // 0: on, 1: 3 sec, 2: 5 sec, 3: 10 sec, 4: off
  byte duration;  // spray duration
  char ssid[32];
  char pass[63];
} deviceSet;

union floatToBytes
{
  char text[4];
  float value;
} fl2b;

union charToBytes
{
  char text[3];
  byte value;
} c2b;

unsigned long counter_send, counter_receive, counter_blink, counter_backlight = 0;
byte state, btn_set, blinker, indx, len = 0;
bool backlight_btn = true;
bool restart = false;
char timeTemplate[6];

/*
pin GPIO 14 / D5
pin GPIO 12 / D6
pin GPIO 13 / D7
*/

const int buttonUp = 14;
const int buttonDown = 12;
const int buttonSet = 13;

unsigned long lastDebounceTime = 0;
unsigned long debounceDelay = 250;

int lcdColumns = 16;
int lcdRows = 2;
LiquidCrystal_I2C lcd(LCD_ADDRESS, lcdColumns, lcdRows);

byte charDegree[8] = {
    0b00010,
    0b00101,
    0b00010,
    0b00000,
    0b00000,
    0b00000,
    0b00000,
    0b00000};

byte charT1[8] = {
    0b11100,
    0b01000,
    0b01000,
    0b00010,
    0b00110,
    0b00010,
    0b00010,
    0b00111};

byte charT2[8] = {
    0b11100,
    0b01000,
    0b01000,
    0b00110,
    0b00001,
    0b00010,
    0b00100,
    0b00111};

byte charT3[8] = {
    0b11100,
    0b01000,
    0b01000,
    0b00110,
    0b00001,
    0b00010,
    0b00001,
    0b00110};

// Declare functions ---------------------------------------------------

void sendSettings();
void receiveStatus();
void factoryReset();
void writeChartoEEPROM();
void fetchEEPROM();
bool buttonRead(int pin);
void backlightMode();
unsigned long minuteToMillis(unsigned long minute);
byte decToBcd(byte val);
byte bcdToDec(byte val);
void setDS3231time(byte second, byte minute, byte hour, byte dayOfWeek, byte dayOfMonth, byte month, byte year);
void readDS3231time(byte *second, byte *minute, byte *hour, byte *dayOfWeek, byte *dayOfMonth, byte *month, byte *year);
void debugging();
void displayMain();
void displayTempSet();
void displayTempSetEdit();
void displayTimeSet();
void displayTimeSetT1Hour();
void displayTimeSetT1Minute();
void displayTimeSetT2Hour();
void displayTimeSetT2Minute();
void displayTimeSetT3Hour();
void displayTimeSetT3Minute();
void displayTimerSelect();
void displayTimerSelectT1Edit();
void displayTimerSelectT2Edit();
void displayTimerSelectT3Edit();
void displayDurationSet();
void displayDurationSetEdit();
void displayBacklightSettings();
void displayBacklightSettingsEdit();
void displayRTCset();
void displayRTCsetHour();
void displayRTCsetMinute();
void displayFactoryReset();
void displayFactoryResetConfirm();
void displayMenu();
void buttonMenu();
String statusTimer(byte status);
String concatTime(byte hour, byte minute);
byte splitTime(char time, char params);
void setupServer();

// I2C Comms -----------------------------------------------------------

void sendSettings()
{ // send per sec
  if (millis() - counter_send >= 1000)
  {
    Wire.beginTransmission(ATM_ADDRESS);
    fl2b.value = temperature.threshold;
    Wire.write(fl2b.text, 4);
    Wire.write(RTC.hour);
    Wire.write(RTC.minute);
    Wire.write(deviceSet.duration);
    Wire.write(timer1.hour);
    Wire.write(timer1.minute);
    Wire.write(timer1.setting);
    Wire.write(timer2.hour);
    Wire.write(timer2.minute);
    Wire.write(timer2.setting);
    Wire.write(timer3.hour);
    Wire.write(timer3.minute);
    Wire.write(timer3.setting);
    Wire.endTransmission();
    counter_send = millis();
  }
}

void receiveStatus()
{ // receive per sec
  if (millis() - counter_receive >= 1000)
  {
    Wire.requestFrom(ATM_ADDRESS, 4);
    while (Wire.available())
    {
      fl2b.text[indx] = Wire.read();
      indx++;
    }
    indx = 0;
    temperature.celcius = fl2b.value;
    counter_receive = millis();
  }
}

// Utility function -----------------------------------------------------

void factoryReset()
{
  setDS3231time(00, 00, 00, 7, 01, 10, 22);
  temperature.threshold = 30.5;
  EEPROM.put(0, temperature.threshold);
  EEPROM.put(4, 0);
  EEPROM.put(5, 1);
  EEPROM.put(6, 0);
  EEPROM.put(7, 0);
  EEPROM.put(8, 0);
  EEPROM.put(9, 0);
  EEPROM.put(10, 0);
  EEPROM.put(11, 0);
  EEPROM.put(12, 0);
  EEPROM.put(13, 0);
  EEPROM.put(14, 0);
  strcpy(deviceSet.ssid, "ESP Mtech");
  len = strlen(deviceSet.ssid);
  EEPROM.put(15, len);
  for (int i = 0; i < len; i++)
  {
    EEPROM.put(16 + i, deviceSet.ssid[i]);
  }
  strcpy(deviceSet.pass, "1234567890");
  len = strlen(deviceSet.pass);
  EEPROM.put(48, len);
  for (int i = 0; i < len; i++)
  {
    EEPROM.put(49 + i, deviceSet.pass[i]);
  }
  EEPROM.commit();
  restart = true;
}

void fetchEEPROM()
{
  EEPROM.get(0, temperature.threshold);
  EEPROM.get(4, deviceSet.backlight);
  EEPROM.get(5, deviceSet.duration);
  EEPROM.get(6, timer1.hour);
  EEPROM.get(7, timer1.minute);
  EEPROM.get(8, timer1.setting);
  EEPROM.get(9, timer2.hour);
  EEPROM.get(10, timer2.minute);
  EEPROM.get(11, timer2.setting);
  EEPROM.get(12, timer3.hour);
  EEPROM.get(13, timer3.minute);
  EEPROM.get(14, timer3.setting);
  byte len;
  EEPROM.get(15, len);
  for (int i = 0; i < len; i++)
  {
    EEPROM.get(16 + i, deviceSet.ssid[i]);
  }
  EEPROM.get(48, len);
  for (int i = 0; i < len; i++)
  {
    EEPROM.get(49 + i, deviceSet.pass[i]);
  }
}

bool buttonRead(int pin)
{
  if ((millis() - lastDebounceTime) > debounceDelay)
  {
    if (digitalRead(pin) == LOW)
    {
      lastDebounceTime = millis();
      backlight_btn = true;
      return true;
    }
    else
    {
      backlight_btn = false;
      return false;
    }
  }
  else
  {
    return false;
  }
}

void backlightMode()
{
  if (deviceSet.backlight == 0)
  {
    lcd.setBacklight(HIGH);
  }

