muryamuya/auto-spray-esp8266-atmega328p/auto_spray_main/src/auto_spray_main_wifi.cpp
  if (state == 2 && btn_set == 3)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (timer2.hour < 23)
      {
        timer2.hour++;
      }
      else
      {
        timer2.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (timer2.hour > 0)
      {
        timer2.hour--;
      }
      else
      {
        timer2.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 4;
    }
  }

  if (state == 2 && btn_set == 4)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (timer2.minute < 59)
      {
        timer2.minute++;
      }
      else if (timer2.hour < 23)
      {
        timer2.minute = 0;
        timer2.hour++;
      }
      else
      {
        timer2.minute = 0;
        timer2.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (timer2.minute > 0)
      {
        timer2.minute--;
      }
      else if (timer2.hour > 0)
      {
        timer2.minute = 59;
        timer2.hour--;
      }
      else
      {
        timer2.minute = 59;
        timer2.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 5;
    }
  }

  if (state == 2 && btn_set == 5)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (timer3.hour < 23)
      {
        timer3.hour++;
      }
      else
      {
        timer3.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (timer3.hour > 0)
      {
        timer3.hour--;
      }
      else
      {
        timer3.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 6;
    }
  }

  if (state == 2 && btn_set == 6)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (timer3.minute < 59)
      {
        timer3.minute++;
      }
      else if (timer3.hour < 23)
      {
        timer3.minute = 0;
        timer3.hour++;
      }
      else
      {
        timer3.minute = 0;
        timer3.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (timer3.minute > 0)
      {
        timer3.minute--;
      }
      else if (timer3.hour > 0)
      {
        timer3.minute = 59;
        timer3.hour--;
      }
      else
      {
        timer3.minute = 59;
        timer3.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      EEPROM.put(6, timer1.hour);
      EEPROM.put(7, timer1.minute);
      EEPROM.put(9, timer2.hour);
      EEPROM.put(10, timer2.minute);
      EEPROM.put(12, timer3.hour);
      EEPROM.put(13, timer3.minute);
      EEPROM.commit();
      btn_set = 0;
    }
  }

  if (state == 3 && btn_set == 1)
  {
    if (buttonRead(buttonUp) == true)
    {
      timer1.setting = 1;
    }
    if (buttonRead(buttonDown) == true)
    {
      timer1.setting = 0;
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 2;
    }
  }

  if (state == 3 && btn_set == 2)
  {
    if (buttonRead(buttonUp) == true)
    {
      timer2.setting = 1;
    }
    if (buttonRead(buttonDown) == true)
    {
      timer2.setting = 0;
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 3;
    }
  }

  if (state == 3 && btn_set == 3)
  {
    if (buttonRead(buttonUp) == true)
    {
      timer3.setting = 1;
    }
    if (buttonRead(buttonDown) == true)
    {
      timer3.setting = 0;
    }
    if (buttonRead(buttonSet) == true)
    {
      EEPROM.put(8, timer1.setting);
      EEPROM.put(11, timer2.setting);
      EEPROM.put(14, timer3.setting);
      EEPROM.commit();
      btn_set = 0;
    }
  }

  if (state == 4 && btn_set == 1)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (deviceSet.duration < 60)
      {
        deviceSet.duration++;
      }
      else
      {
        deviceSet.duration = 1;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (deviceSet.duration > 1)
      {
        deviceSet.duration--;
      }
      else
      {
        deviceSet.duration = 60;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      EEPROM.put(5, deviceSet.duration);
      EEPROM.commit();
      btn_set = 0;
    }
  }

  if (state == 5 && btn_set == 1)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (deviceSet.backlight > 0)
      {
        deviceSet.backlight--;
      }
      else
      {
        deviceSet.backlight = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (deviceSet.backlight < 4)
      {
        deviceSet.backlight++;
      }
      else
      {
        deviceSet.backlight = 4;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      EEPROM.put(4, deviceSet.backlight);
      EEPROM.commit();
      btn_set = 0;
    }
  }

  if (state == 6 && btn_set == 1)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (RTC.hour < 23)
      {
        RTC.hour++;
      }
      else
      {
        RTC.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (RTC.hour > 0)
      {
        RTC.hour--;
      }
      else
      {
        RTC.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 2;
    }
  }

  if (state == 6 && btn_set == 2)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (RTC.minute < 59)
      {
        RTC.minute++;
      }
      else if (RTC.hour < 23)
      {
        RTC.minute = 0;
        RTC.hour++;
      }
      else
      {
        RTC.minute = 0;
        RTC.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (RTC.minute > 0)
      {
        RTC.minute--;
      }
      else if (RTC.hour > 0)
      {
        RTC.minute = 59;
        RTC.hour--;
      }
      else
      {
        RTC.minute = 59;
        RTC.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      setDS3231time(00, RTC.minute, RTC.hour, 7, 01, 10, 22);
      btn_set = 0;
    }
  }

  if (state == 7 && btn_set == 1)
  {
    if (buttonRead(buttonUp) == true || buttonRead(buttonDown) == true)
    {
      lcd.clear();
      btn_set = 0;
    }
    if (buttonRead(buttonSet) == true)
    {
      factoryReset();
      lcd.clear();
      lcd.setCursor(4, 0);
      lcd.print("Success!");
      delay(2000);
      lcd.clear();
      btn_set = 0;
      state = 0;
    }
  }
}

// Web function ----------------------------------------------

String statusTimer(byte status)
{
  if (status == 1)
  {
    return "On";
  }
  else
    return "Off";
}

String concatTime(byte hour, byte minute)
{
  String hr, mnt, conc;
  if (hour < 10)
  {
    hr = "0" + String(hour);
  }
  else
  {
    hr = String(hour);
  }
  if (minute < 10)
  {
    mnt = "0" + String(minute);
  }
  else
  {
    mnt = String(minute);
  }
  conc = hr + " : " + mnt;
  return conc;
}

byte splitTime(const char time[6], const char* params){ // Parameter: hr = get hour, mnt = get minute.
  if(strcmp(params, "hr") == 0){
    for (byte i=0; i<1; i++){
      c2b.text[i] = time[i];
    }
    return c2b.value;
  }
  else if(strcmp(params, "mnt") == 0){
    for (byte i=0; i<1; i++){
      c2b.text[i] = time[i+3];
    }
    return c2b.value;
  }
  else return 0;
}

void setupServer()
{
  webServer.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
               { request->send(LittleFS, "/index.html", "text/html", false); });

  webServer.serveStatic("/", LittleFS, "/");

  webServer.on("/temp", HTTP_GET, [](AsyncWebServerRequest *request)
               { request->send_P(200, "text/plain", String(temperature.celcius).c_str()); });

