muryamuya/auto-spray-esp8266-atmega328p/auto_spray_main/src/auto_spray_main_wifi.cpp
  webServer.on("/thresh", HTTP_GET, [](AsyncWebServerRequest *request)
               { request->send_P(200, "text/plain", String(temperature.threshold).c_str()); });

  webServer.on("/time", HTTP_GET, [](AsyncWebServerRequest *request)
               { request->send_P(200, "text/plain", concatTime(RTC.hour, RTC.minute).c_str()); });

  webServer.on("/timer1", HTTP_GET, [](AsyncWebServerRequest *request)
               { request->send_P(200, "text/plain", concatTime(timer1.hour, timer1.minute).c_str()); });

  webServer.on("/timer1status", HTTP_GET, [](AsyncWebServerRequest *request)
               { request->send_P(200, "text/plain", statusTimer(timer1.setting).c_str()); });

  webServer.on("/timer2", HTTP_GET, [](AsyncWebServerRequest *request)
               { request->send_P(200, "text/plain", concatTime(timer2.hour, timer2.minute).c_str()); });

  webServer.on("/timer2status", HTTP_GET, [](AsyncWebServerRequest *request)
               { request->send_P(200, "text/plain", statusTimer(timer2.setting).c_str()); });

  webServer.on("/timer3", HTTP_GET, [](AsyncWebServerRequest *request)
               { request->send_P(200, "text/plain", concatTime(timer3.hour, timer3.minute).c_str()); });

  webServer.on("/timer3status", HTTP_GET, [](AsyncWebServerRequest *request)
               { request->send_P(200, "text/plain", statusTimer(timer3.setting).c_str()); });

  webServer.on("/duration", HTTP_GET, [](AsyncWebServerRequest *request)
               { request->send_P(200, "text/plain", String(deviceSet.duration).c_str()); });

  webServer.on("/wifi", HTTP_POST, [](AsyncWebServerRequest *request)
               {
    int params = request->params();
    for (int i=0; i<params; i++){
      AsyncWebParameter* p = request->getParam(i);
      if(p->isPost()){
        if (p->name() == "ssid") {
          strcpy(deviceSet.ssid, p->value().c_str());
          len = strlen(deviceSet.ssid);
          EEPROM.put(15, len);
          for(int i=0; i<len; i++){
            EEPROM.put(16 + i, deviceSet.ssid[i]);
          }
          }
        if (p->name() == "pass") {
          strcpy(deviceSet.pass, p->value().c_str());
          len = strlen(deviceSet.pass);
          EEPROM.put(48, len);
          for(int i=0; i<len; i++){
            EEPROM.put(49 + i, deviceSet.pass[i]);
          }
          }
        EEPROM.commit();
        request->send(200, "text/plain", "Data diterima, alat akan restart.");
        restart = true;
      }
    } });

    webServer.on("/settings", HTTP_POST, [](AsyncWebServerRequest *request)
               {
    int params = request->params();
    for (int i=0; i<params; i++){
      AsyncWebParameter* p = request->getParam(i);
      if(p->isPost()){
        if (p->name() == "TempThresh") {
          strcpy(fl2b.text, p->value().c_str());
          temperature.threshold = fl2b.value;
          EEPROM.put(0, temperature.threshold);
          }
        if (p->name() == "T1") {
          strcpy(timeTemplate, p->value().c_str());
          timer1.hour = splitTime(timeTemplate, "hr");
          timer1.minute = splitTime(timeTemplate, "mnt");
          EEPROM.put(6, timer1.hour);
          EEPROM.put(7, timer1.minute);
          }
        if (p->name() == "statusT1") {
          strcpy(fl2b.text, p->value().c_str());
          if (strcmp(fl2b.text, "on") == 0){
            timer1.setting = 1;
          }
          else{
            timer1.setting = 0;
          }
          EEPROM.put(8, timer1.setting);
          }
        if (p->name() == "T2") {
          strcpy(timeTemplate, p->value().c_str());
          timer2.hour = splitTime(timeTemplate, "hr");
          timer2.minute = splitTime(timeTemplate, "mnt");
          EEPROM.put(9, timer2.hour);
          EEPROM.put(10, timer2.minute);
          }
          if (p->name() == "statusT2") {
          strcpy(fl2b.text, p->value().c_str());
          if (strcmp(fl2b.text, "on") == 0){
            timer2.setting = 1;
          }
          else{
            timer2.setting = 0;
          }
          EEPROM.put(11, timer2.setting);
          }
        if (p->name() == "T3") {
          strcpy(timeTemplate, p->value().c_str());
          timer3.hour = splitTime(timeTemplate, "hr");
          timer3.minute = splitTime(timeTemplate, "mnt");
          EEPROM.put(12, timer3.hour);
          EEPROM.put(13, timer3.minute);
          }
          if (p->name() == "statusT3") {
          strcpy(fl2b.text, p->value().c_str());
          if (strcmp(fl2b.text, "on") == 0){
            timer3.setting = 1;
          }
          else{
            timer3.setting = 0;
          }
          EEPROM.put(14, timer3.setting);
          }
        if (p->name() == "duration") {
          strcpy(c2b.text, p->value().c_str());
          deviceSet.duration = c2b.value;
          EEPROM.put(5, deviceSet.duration);
          }
        EEPROM.commit();
        request->send(200, "text/plain", "Data telah diterima dan disimpan, silahkan kembali ke laman utama.");
      }
    } });
}

// Main function ---------------------------------------------

void setup()
{
  LittleFS.begin();
  // Serial.begin(9600);
  EEPROM.begin(EEPROM_SIZE);
  fetchEEPROM();
  Wire.begin(1);
  pinMode(buttonUp, INPUT_PULLUP);
  pinMode(buttonDown, INPUT_PULLUP);
  pinMode(buttonSet, INPUT_PULLUP);
  lcd.init();
  lcd.backlight();
  lcd.createChar(0, charDegree);
  lcd.createChar(1, charT1);
  lcd.createChar(2, charT2);
  lcd.createChar(3, charT3);
  lcd.setCursor(0, 0);
  lcd.print("Multitechnologi");
  delay(3000);
  lcd.clear();
  WiFi.mode(WIFI_AP);
  WiFi.softAPConfig(APIP, APIP, subnet_mask);
  WiFi.softAP(deviceSet.ssid, deviceSet.pass);
  setupServer();
  dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
  webServer.addHandler(new CaptiveRequestHandler()).setFilter(ON_AP_FILTER);
  webServer.begin();
}

void loop()
{
  receiveStatus();
  buttonMenu();
  displayMenu();
  backlightMode();
  sendSettings();
  dnsServer.processNextRequest();
  if (restart)
  {
    delay(5000);
    ESP.restart();
  }
  // debugging();
}
